app/controllers/notes_controller.rb

 def index
@notes = Note.all.order("created_at DESC")
---
SELECT "notes".* FROM "notes" ORDER BY created_at DESC

 def create
    @note = Note.new(note_params)

    if @note.save
---
INSERT INTO "notes" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Some new title"], ["content", "new note here"], ["created_at", "2022-02-19 21:57:04.432650"], ["updated_at", "2022-02-19 21:57:04.432650"]]

 def update
  if @note.update(note_params)
---
UPDATE "notes" SET "content" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["content", "new note here with another bit"], ["updated_at", "2022-02-19 22:27:17.154467"], ["id", 4]]

 def find_note
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]